In [5]:
import pandas as pd
import numpy as np
import re
from pandas import ExcelWriter

In [12]:
df = pd.read_excel('/Users/William/Desktop/codebase/timeseries clustering/sales_data_sample.xlsx')
df.head()

,Order Number,Quantity Ordered,Unit Price,Order Line Number,Sales,Order Date,Status,Quarter,Month,Year,...,Customer Name,Phone,Address Line,City,State,Postal Code,Country,Last Name,First Name,Deal Size
0,10107,30,95.70,2,2871.00,2003-02-24,Shipped,1,2,2003,...,Land of Toys Inc.,2125557818,897 Long Airport Avenue,NYC,NY,10022,USA,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,2,5,2003,...,Reims Collectables,26.47.1555,59 rue de l'Abbaye,Reims,NaN,51100,France,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,3,7,2003,...,Lyon Souveniers,+33 1 46 62 7555,27 rue du Colonel Pierre Avia,Paris,NaN,75508,France,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,Toys4GrownUps.com,6265557265,78934 Hillside Dr.,Pasadena,CA,90003,USA,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,4,10,2003,...,Corporate Gift Ideas Co.,6505551386,7734 Strong St.,San Francisco,CA,NaN,USA,Brown,Julie,Medium

In [19]:
#function objective: to figure out the top 10 products from a dataset

def top_product():
    df = pd.read_excel('/Users/William/Desktop/codebase/timeseries clustering/sales_data_sample.xlsx')
    df = df.sort_values(by = 'Sales', ascending = False)
    df = df.reset_index(drop = True)
    
    master_product_number_list = []
    master_product_line = []
    sums = []
    
    for index, row in df.iterrows():
        if row['Product Code'] not in master_product_number_list and row['Product Line'] not in master_product_line:
            master_product_number_list.append(row['Product Code'])
            master_product_line.append(row['Product Line'])
    
    for product in master_product_number_list:
        sums.append(df.loc[df['Product Code'] == product, 'Sales'].sum())
        
    master_product_number_list.insert(0, 'Product Code')
    master_product_line.insert(0, 'Product Line')
    sums.insert(0, 'Sum of Sales')
    
    xd = pd.DataFrame({'Product Line': master_product_line, 'Product Number': master_product_number_list, 'Sum of Sales': sums})
    xd = xd.ix[1:]
    xd = xd.sort_values(by = 'Sum of Sales', ascending = False)
    xd = xd.reset_index(drop = True)
    xd = xd.drop(xd.index[20:])
    return xd

top_product()

       Product Line Product Number Sum of Sales
0      Classic Cars       S10_1949       191073
1       Motorcycles       S10_4698       170401
2      Vintage Cars       S18_1749       127310
3             Ships       S24_2011       114032
4            Planes      S700_1691      83953.5
5            Trains       S50_1514      71495.8
6  Trucks and Buses       S32_2509      61979.5

In [ ]:
pr = df.copy()
#function objective: to create a new DataFrame that contains the following columns: Customer Name/Year/Quarter (sold)/Quantity/Orderable Product Number
def formatted_data():
    #df is top 10 products based off of segment4 cumulative revenue
    df = pd.read_excel('/Users/William/Desktop/PTC/ranked_products.xlsx')
    df = df.rename(columns={'Product #': 'Segment 4 Description'})
    prod = pr.copy()
    new = []
    col = ['Sold To Customer Name', 'Product Installed Fiscal Year', 'Quantity', 'Segment 4 Description', 'Quarter']
    top = 0
    for index, row in df.iterrows():
        isit = False
        for index_, row_ in prod.iterrows():
            if row['Segment 4 Description'] == row_['Segment 4 Description']:
                new.append(row_)
                isit = True
        if isit == True:
            top += 1
        if top == 11:
            break
            
    xd = pd.DataFrame(data = new, columns = col)
    xd = xd.reset_index(drop = True)
    writer = ExcelWriter('/Users/William/Desktop/PTC/Export3.xlsx')
    xd.to_excel(writer, 'Sheet1')
    writer.save()
    return xd

formatted_data()